app/controllers/despesas_controller.rb

SELECT "despesas".* FROM "despesas"
---
  def index
    @despesas = Despesa.all

INSERT INTO "despesas" ("nomedespesa", "datavencimento", "valor", "saldo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nomedespesa", "aluguel"], ["datavencimento", "20-01-2016"], ["valor", "100000"], ["saldo", "000"], ["created_at", "2016-05-20 17:05:41.571895"], ["updated_at", "2016-05-20 17:05:41.571895"]]
---
  def create
    @despesa = Despesa.new(despesa_params)

    respond_to do |format|
      if @despesa.save

UPDATE "despesas" SET "nomedespesa" = ?, "datavencimento" = ?, "valor" = ?, "saldo" = ?, "updated_at" = ? WHERE "despesas"."id" = ?  [["nomedespesa", "aluguel"], ["datavencimento", "20-01-2016"], ["valor", "100000"], ["saldo", "000"], ["updated_at", "2016-05-20 17:05:41.626756"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @despesa.update(despesa_params)

DELETE FROM "despesas" WHERE "despesas"."id" = ?  [["id", 1]]
---
  def destroy
    @despesa.destroy

SELECT  "despesas".* FROM "despesas" WHERE "despesas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_despesa
      @despesa = Despesa.find(params[:id])