app/controllers/pagamentos_controller.rb

  def index
    @pagamentos = Pagamento.all
---
SELECT "pagamentos".* FROM "pagamentos"

  def create
    @pagamento = Pagamento.new(pagamento_params)

    respond_to do |format|
      if @pagamento.save
---
INSERT INTO "pagamentos" ("despesa_id", "formapagamento", "data", "valor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["despesa_id", 1], ["formapagamento", ""], ["data", ""], ["valor", ""], ["created_at", "2016-05-20 18:53:42.231916"], ["updated_at", "2016-05-20 18:53:42.231916"]]

  def update
    respond_to do |format|
      if @pagamento.update(pagamento_params)
---
UPDATE "pagamentos" SET "formapagamento" = ?, "updated_at" = ? WHERE "pagamentos"."id" = ?  [["formapagamento", ""], ["updated_at", "2016-05-20 18:53:42.183792"], ["id", 1]]

  def destroy
    @pagamento.destroy
---
DELETE FROM "pagamentos" WHERE "pagamentos"."id" = ?  [["id", 1]]

    def set_pagamento
      @pagamento = Pagamento.find(params[:id])
---
SELECT  "pagamentos".* FROM "pagamentos" WHERE "pagamentos"."id" = ? LIMIT 1  [["id", 1]]