app/controllers/receitas_controller.rb

SELECT "receitas".* FROM "receitas"
---
  def index
    @receitas = Receita.all

INSERT INTO "receitas" ("nomereceita", "datavencimento", "valor", "saldo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nomereceita", "acoes"], ["datavencimento", "20-01-2016"], ["valor", "100000"], ["saldo", "3000"], ["created_at", "2016-05-20 17:21:13.842606"], ["updated_at", "2016-05-20 17:21:13.842606"]]
---
  def create
    @receita = Receita.new(receita_params)

    respond_to do |format|
      if @receita.save

UPDATE "receitas" SET "nomereceita" = ?, "datavencimento" = ?, "valor" = ?, "saldo" = ?, "updated_at" = ? WHERE "receitas"."id" = ?  [["nomereceita", "acoes"], ["datavencimento", "20-01-2016"], ["valor", "100000"], ["saldo", "3000"], ["updated_at", "2016-05-20 17:21:13.885388"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @receita.update(receita_params)

DELETE FROM "receitas" WHERE "receitas"."id" = ?  [["id", 1]]
---
  def destroy
    @receita.destroy

SELECT  "receitas".* FROM "receitas" WHERE "receitas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_receita
      @receita = Receita.find(params[:id])